# Load/unload environment variables based on $PWD
brew "direnv"
# GNU compiler collection
brew "gcc"
# Rainbows and unicorns in your console!
brew "lolcat"
# GitHub command-line tool
brew "gh"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
vscode "donjayamanne.githistory"
vscode "editorconfig.editorconfig"
vscode "github.copilot-chat"
vscode "jetmartin.bats"
vscode "mhutchie.git-graph"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode.live-server"
vscode "nefrob.vscode-just-syntax"
vscode "repreng.csv"
vscode "traycer.traycer-vscode"
vscode "waderyan.gitblame"
